Repository: wkddnjset/K-Global-Starthon
Catalog: Project/Watson API/tmx/deep_learning.tmx
Source language: en
Languages: ko

source: Deep learning which is a subfield of machine learning began to be used in music genre classification in recent years.
ko: 기계학습의 한 분야인 딥러닝은 최근 다양한 분야에서 비약적인 성능 향상에 기여하였다.

source: In this paper, we propose a model that can utilize the multimodal deep learning architecture in the music genre classification problem.
ko: 본 논문은 음악 장르분류 문제에 있어서 최초로 멀티모달 딥러닝 구조를 이용할 수 있는 모델을 제안한다.

source: CNN(Convolutional Neural Network) was used for the spectrogram image of music and RNN(Recurrent Neural Network) was used for the sequential data of the sound.
ko: 음악의 스펙트로그램 이미지에 대한 분석을 위해 CNN(Convolutional Neural Network)을 사용하였으며, 음원의 연속적인 데이터에 대해 RNN(Recurrent Neural Network)을 사용하였다.

source: In addition, dropout which is a representative regularizer was applied to prevent overfitting.
ko: 또한 대표적인 정규화(Regularization)기법인 dropout 을 적용하여 과적합(overfitting) 문제를 해결하였다.

source: The model using multimodal deep learning proposed in this study was found to be more effective than unimodal deep learning for music genre classification.
ko: 본 연구에서 제안된 멀티모달 딥러닝 모델이 단일 딥러닝 방법보다 음악 장르 분류의 성능 향상에 탁월하게 작용함을 확인할 수 있었다.

source: For accurate precipitation forecasts the choice of weather faoctrs and prediction method is very important.
ko: 정확한 강수예측을 위해서는 예측인자 선정과 예측방법에 대한 선택이 매우 중요하다.

source: Recently, machinele arning has been widely used for forecasting precipitation, and artificial neural network, one of machine learning techniques, showed good performance.
ko: 최근에는 강수예측 방법으로 기계학습 기법이 많이 사용되고 있으며, 그 중에서도 특히 인공신경망을 사용한 강수예측 방법은 좋은 성능을 보였다.

source: In this paper, we suggest a new method for forecasting precipitation using DBN, one of deep learning techniques.
ko: 본 논문에서는 딥러닝 기법 중 하나인 DBN(deep belief network)를 이용한 새로운 강수예측 방법을 제안한다.

source: DBN has an advantage that initial weights are set by unsupervised learning, so this compensates for the defects of artificial neural networks.
ko: DBN는 비지도 사전 학습을 통해 초기 가중치를 설정하여 기존 인공신경망의 문제점을 보완한다.

source: We used past precipitation, temperature, and the parameters of the sun and moon"s motion as features for forecasting precipitation.
ko: 예측인자로는 기온, 전일-전주 강수일, 태양과 달 궤도 관련 자료를 선정하였다.

source: The dataset consists of observation data which had been measured for 40 years from AWS in Seoul.
ko: 기온과 전일-전주 강수일은 서울에서의 1974년부터 2013년까지 총 40년간의 AWS(automatic weather system) 관측 자료를 사용하였고, 태양과 달의 궤도 관련 자료는 서울을 중심으로 계산한 결과를 사용하였다.

source: Experiments were based on 8-fold cross validation.
ko: 전체 기간에서 일부는 학습 자료로 사용하여 예측모델을 생성하였고, 나머지를 생성한 모델의 검증 자료로 사용하였다.

source: As a result of estimation, we got probabilities of test dataset, so threshold was used for the decision of precipitation.
ko: 모델 검증 결과로 나온 예측값들은 확률값을 가지며 임계치를 이용하여 강수유무를 판별하였다.

source: CSI and Bias were used for indicating the precision of precipitation.
ko: 강수 정확도의 척도로 양분예보기법 중 CSI(critical successive index)와 Bias(frequency bias)를 계산하였다.

source: Our experimental results showed that DBN performed better than MLP.
ko: 이를 통해 DBN와 MLP(multilayer perceptron)의 성능을 비교한 결과 DBN의 강수 예측 정확도가 높았고, 수행속도 또한 2배 이상 빨랐다.

source: Recently, a number of techniques to ensure the free walking for the visually impaired and transportation vulnerable have been studied.
ko: 최근 시각장애인 및 교통약자의 자유로운 보행을 보장하기 위한 많은 기술들이 연구되고 있다.

source: As a device for free walking, there are such as a smart cane and smart glasses to use the computer vision, ultrasonic sensor, acceleration sensor technology.
ko: 자유로운 보행을 위한 장치로는 영상카메라, 초음파센서 및 가속도 센서 등을 이용하는 스마트 지팡이와 스마트 안경 관련 기술이 있다.

source: In a typical technique, such as techniques for finds object and detect obstacles and walking area and recognizes the symbol information for notice environment information.
ko: 대표적인 기술로는 물체를 식별하여 장애물을 검출하고 보행 가능 영역을 추출하는 기술, 랜드마크 심볼 정보를 인식하여 주위 환경 정보를 주는 기술 등 여러 가지 기술이 개발되고 있다.

source: In this paper, we studied recognization algorithm of the selected symbols that are required to visually impaired, with the deep learning algorithm.
ko: 본 논문에서는 시각장애인에게 필요한 시설의 대표 심볼을 선정하여 착용한 영상 장치의 정보로부터 심볼을 인식하는 알고리즘을 딥러닝 기술을 이용하여 연구하였다.

source: As a results, Use CNN(Convolutional Nueral Network) technique used in the field of deep-learning image processing, and analyzed by comparing through experimentation with various deep learning architectures.
ko: 그 결과로 딥러닝 영상처리 분야에서 사용되는 CNN(Convolutional Neural Network)기법을 사용하여 서로 다른 딥러닝 구조를 실험을 통하여 비교하고 분석하였다.

source: Deep learning model is a kind of neural networks that allows multiple hidden layers.
ko: 딥러닝은 인공신경망(neural network)이라는 인공지능분야의 모형이 발전된 형태로서, 계층구조로 이루어진 인공신경망의 내부계층(hidden layer)이 여러 단계로 이루어진 구조이다.

source: There are various deep learning architectures such as convolutional neural networks, deep belief networks and recurrent neural networks.
ko: 딥러닝에서의 주요 모형은 합성곱신경망(convolutional neural network), 순환신경망(recurrent neural network), 그리고 심층신뢰신경망(deep belief network)의 세가지라고 할 수 있다.

source: Those have been applied to fields like computer vision, automatic speech recognition, natural language processing, audio recognition and bioinformatics where they have been shown to produce state-of-the-art results on various tasks.
ko: 그 중에서 현재 흥미로운 연구가 많이 발표되어서 관심이 집중되고 있는 모형은 지도학습(supervised learning)모형인 처음 두 개의 모형이다.

source: Among those architectures, convolutional neural networks and recurrent neural networks are classified as the supervised learning model.
ko: 따라서 본 논문에서는 지도학습모형의 가중치를 최적화하는 기본적인 방법인 오류역전파 알고리즘을 살펴본 뒤에 합성곱신경망과 순환신경망의 구조와 응용사례 등을 살펴보고자 한다.

source: And in recent years, those supervised learning models have gained more popularity than unsupervised learning models such as deep belief networks, because supervised learning models have shown fashionable applications in such fields mentioned above.
ko: 본문에서 다루지 않은 모형인 심층신뢰신경망은 아직까지는 합성곱신경망 이나 순환신경망보다는 상대적으로 주목을 덜 받고 있다.

source: Steganalysis is to detect information hidden by steganography inside general data such as images.
ko: 그러나 심층신뢰신경망은 CNN이나 RNN과는 달리 비지도학습(unsupervised learning)모형이며, 사람이나 동물은 관찰을 통해서 스스로 학습한다는 점에서 궁극적으로는 비지도학습모형이 더 많이 연구되어야 할 주제가 될 것이다.

source: There are stegoanalysis techniques that use machine learning (ML).
ko: 스테그아날리시스(Steganalysis)란 이미지 등 일반적인 자료에 암호화된 정보를 은닉하는 스테가노그래피(Steganography)에 대한 검출 및 분석 방법으로, 기계학습 기반 방법론을 포함한다.

source: Existing ML approaches to steganalysis are based on extracting features from stego images and modeling them.
ko: 기존 기계학습 기반 스테그아날리시스는 영상(Image)의 특징(Feature) 추출 및 모델링에 기반하며, 최근 딥러닝(Deep Learning)의 적용으로 검출 정확도가 큰 폭으로 향상되었다.

source: Recently deep learning-based methodologies have shown significant improvements in detection accuracy.
ko: 하지만 현존하는 스테그아날리시스 모델은 단일 스테가노그래피 기법에 대해 국한되어 있어 학습에 사용되지 않은 스테고(Stego) 이미지의 경우 검출이 불가능한 결정적 한계를 가진다.

source: However, all the existing methods, including deep learning-based ones, have a critical limitation in that they can only detect stego images that are created by a specific steganography method.
ko: 본 연구에서는 다양한 스테가노그래피 기법으로 생성된 스테고이미지에 딥러닝을 적용하여 스테그아날리시스를 학습하는 범용적 모델을 제안한다.

source: In this paper, we propose a generalized steganalysis method that can model multiple types of stego images using deep learning.
ko: 다양한 실험을 통해 제안 기법의 효용성 및 가능성을 확인하고, 범용적 스테그아날리시스 모델이 각각에 특화된 검출 기법과 유사한 정확도로 스테고 이미지를 검출할 수 있음을 보인다.

source: Through various experiments, we confirm the effectiveness of our approach and envision directions for future research.
ko: 도시에서 홍수 피해를 방지하기 위한 침수를 예측하기 위해 본 논문에서는 딥러닝(Deep Learning)기법을 적용한다.

source: In particular, we show that our method can detect each type of steganography with the same level of accuracy as that of a steganalysis method dedicated to that type of steganography, thereby demonstrating the general applicability of our approach to multiple types of stego images.
ko: 딥러닝 기법 중 시계열 데이터 분석에 적합한 Recurrent Neural Networks (RNNs)을 활용하여 강의 수위 관측 데이터를 학습하고 침수 가능성을 예측하였다.

source: This paper presents an attempt to apply Deep Learning technology to solve the problem of forecasting floods in urban areas.
ko: 예측 정확도 검증을 위해 사용한 데이터는 미국의 트리니티 강의 데이터로, 학습을 위해 2013 년부터 2015 년까지 데이터를 사용하였고 평가 데이터로는 2016 년 데이터를 사용하였다.

source: We employ Recurrent Neural Networks (RNNs), which are suitable for analyzing time series data, to learn observed data of river water and to predict the water level.
ko: 입력은 16개의 레코드로 구성된 15분단위의 시계열 데이터를 사용하였고, 출력으로는 30분과 60분 후의 강의 수위 예측 정보이다.

source: To test the model, we use water observation data of a station in the Trinity River, Texas, the U.S., with data from 2013 to 2015 for training and data in 2016 for testing.
ko: 실험에 사용한 딥러닝 모델들은 표준 RNN, RNN-BPTT(Back Propagation Through Time), LSTM(Long Short-Term Memory)을 사용했는데, 그 중 LSTM의 NE(Nash Efficiency)가 0.98을 넘는 정확도로 기존 연구에 비해 매우 높은 성능 향상을 보였고, 표준 RNN과 RNN-BPTT에 비해서도 좋은 성능을 보였다.

source: Input of the neural networks is a 16-record-length sequence of 15-minute-interval time-series data, and output is the predicted value of the water level at the next 30 minutes and 60 minutes.
ko: 딥러닝 프레임워크의 대표적인 기능으로는 ‘자동미분’과 ‘GPU의 활용’ 등을 들 수 있다.

source: In the experiment, we compare three Deep Learning models including standard RNN, RNN trained with Back Propagation Through Time(RNN-BPTT), and Long Short-Term Memory (LSTM).
ko: 본 논문은 파이썬의 라이브러리 형태로 사용 가능한 프레임워크 중에서 구글의 텐서플로와 마이크로소프트의 CNTK, 그리고 텐서플로의 원조라고 할 수 있는 티아노를 비교하였다.

source: The prediction quality of LSTM can obtain Nash Efficiency exceeding 0.98, while the standard RNN and RNN-BPTT also provide very high accuracy.
ko: 본문에서는 자동미분의 개념과 GPU의 활용형태를 간단히 설명하고, 그 다음에 logistic regression을 실행하는 예를 통하여 각 프레임워크의 문법을 알아본 뒤에, 마지막으로 대표적인 딥러닝 응용인 CNN의 예제를 실행시켜보고 코딩의 편의성과 실행속도 등을 확인해 보았다.

source: Horizon correction is a crucial stage for image composition enhancement.
ko: 그 결과, 편의성의 관점에서 보면 티아노가 가장 코딩 하기가 어렵고, CNTK와 텐서플로는 많은 부분이 비슷하게 추상화 되어 있어서 코딩이 비슷하지만 가중치와 편향을 직접 정의하느냐의 여부에서 차이를 보였다.

source: In this paper, we propose a deep learning based method for estimating the slanted angle of a photograph and correcting it.
ko: 그리고 각 프레임워크의 실행속도에 대한 평가는 ‘큰 차이는 없다’는 것이다.

source: To estimate and correct the horizon direction, existing methods use hand-crafted low-level features such as lines, planes, and gradient distributions.
ko: 텐서플로는 티아노에 비하여 속도가 느리다는 평가가 있어왔는데, 본 연구의 실험에 의하면, 비록 CNN 모형에 국한되었지만, 텐서플로가 아주 조금이지만 빠른 것으로 나타났다.

source: However, these methods may not work well on the images that contain no lines or planes.
ko: CNTK의 경우에도, 비록 실험환경이 달랐지만, 실험환경의 차이에 의한 속도의 차이의 편차범위 이내에 있는 것으로 판단이 되었다.

source: To tackle this limitation and robustly estimate the slanted angle, we propose a convolutional neural network (CNN) based method to estimate the slanted angle by learning more generic features using a huge dataset.
ko: 본 연구에서는 세 종류의 딥러닝 프레임워크만을 살펴보았는데, 위키피디아에 따르면 딥러닝 프레임워크의 종류는 12가지가 있으며, 각 프레임워크의 특징을 15가지 속성으로 구분하여 차이를 특정하고 있다.

source: In addition, we utilize multiple adaptive spatial pooling layers to extract multi-scale image features for better performance.
ko: 그 많은 속성 중에서 사용자의 입장에서 볼 때 중요한 속성은 어떤 언어(파이썬, C++, Java, 등)로 사용가능한지, 어떤 딥러닝 모형에 대한 라이브러리가 잘 구현되어 있는지 등일 것이다.

source: In the experimental results, we show our CNN-based approach robustly and accurately estimates the slanted angle of an image regardless of the image content, even if the image contains no lines or planes at all.
ko: 그리고 사용자가 대규모의 딥러닝 모형을 구축한다면, 다중 GPU 혹은 다중 서버를 지원하는지의 여부도 중요할 것이다.

source: This paper proposes a novel aesthetic photo recomposition method using a deep convolutional neural network (DCNN).
ko: 또한 딥러닝 모형을 처음 학습하는 경우에는 사용설명서가 많은지 예제 프로그램이 많은지 여부도 중요한 기준이 될 것이다.

source: Previous recomposition approaches define the aesthetic score of photo composition based on the distribution of salient objects, and enhance the photo composition by maximizing the score.
ko: 본 논문은 딥 러닝(deep learning)을 이용하여 입력 영상의 기울어진 정도를 측정하고 수평에 맞게 바로 세우는 방법을 제시한다.

source: These methods suffer from heavy computational overheads, and often fail to enhance the composition because their optimization depends on the performance of existing salient object detection algorithms.
ko: 기존 방법들은 일반적으로 영상 내에서 선분, 평면 등 하위 레벨의 특징들을 추출한 후 이를 이용해 영상의 기울어진 정도를 측정한다.

source: Unlike previous approaches, we address the photo recomposition problem by utilizing DCNN, which shows remarkable performance in object detection and recognition.
ko: 이러한 방법들은 영상 내에 선이나 평면이 존재하지 않는 경우에는 제대로 동작하지 않는다.

source: DCNN is used to iteratively predict cropping directions for a given photo, thus generating an aesthetically enhanced photo in terms of composition.
ko: 본 논문에서는 대규모 데이터 셋을 통해 영상의 다양한 특징들에 대해 학습 가능한 Convolutional Neural Network (CNN)를 이용하여 인물이나 복잡한 배경으로 구성된 기울어진 영상에 대해서도 강인하게 동작하는 프레임워크를 제시한다.

source: Experimental results and user study show that the proposed framework can automatically crop the photo to follow specific composition guidelines, such as the rule of thirds.
ko: 또한, 네트워크에 가변 공간적 (adaptive spatial) pooling 레이어를 추가하여 영상의 다중 스케일 특징을 동시에 고려할 수 있게 하여 영상의 기울어진 정도를 측정하는 성능을 높인다.

source: Malware, including ransomware to quickly detect, in this study, to provide an analysis method of malicious code through the image analysis that has been learned in the deep learning of artificial intelligence.
ko: 실험 결과를 통해 다양한 콘텐츠를 포함한 영상의 기울어짐을 높은 정확도로 바로 세울 수 있음을 확인할 수 있다.

source: First, to analyze the 2,400 malware data, and learning in artificial neural network Convolutional neural network and to image data.
ko: 본 논문에서는 딥러닝 기법 중 하나인 deep convolutional neural network (DCNN)을 이용하여 영상의 구도를 개선하는 방법을 제시한다.

source: Extracts subgraphs to convert the graph of abstracted image, summarizes the set represent malware.
ko: 기존의 구도 개선 방법들은 영상의 주요 물체의 위치를 바탕으로 한 구도 평가 점수를 정의한 뒤 최적화를 통해 평가 점수를 향상시키는 방향으로 영상을 개선한다.

source: The experimentally analyzed the malware is not how similar.
ko: 이는 계산량이 많고 기존 주요 물체 검출 알고리즘의 성능에 종속적이기 때문에 영상에 따라 구도 개선이 제대로 수행되지 않는 경우가 존재한다.

source: Using deep learning of artificial intelligence by classifying malware and It shows the possibility of accurate malware detection
ko: 본 논문에서는 영상의 특징 추출에 뛰어난 성능을 보이는 DCNN을 이용해 영상을 반복적으로 크롭하여 미학적으로 구도가 개선된 영상을 얻는 방법을 제안한다.

source: This paper proposes a deep learning algorithm based sign detection and recognition system for the blind.
ko: 실험 결과 및 사용자 평가를 통해 본 논문에서 제안한 알고리즘이 주어진 영상을 특정 구도 가이드라인(삼분할법, 주요 물체의 크기 등)을 따르도록 자동으로 크롭한다는 것을 보인다.

source: The proposed system is composed of sign detection stage and sign recognition stage.
ko: 랜섬웨어를 포함한 악성코드를 빠르게 탐지하여 빅데이터를 보호하기 위해 본 연구에서는 인공지능의 딥러닝으로 학습된 이미지 분석을 통한 악성코드 분석 기법을 제안한다.

source: In the sign detection stage, aggregated channel features are extracted and AdaBoost classifier is applied to detect regions of interest of the sign.
ko: 우선 악성코드들에서 일반적으로 사용하는 2,400여개 이상의 데이터를 분석하여 인공신경망 Convolutional neural network으로 학습하고 데이터를 이미지화 하였다.

source: In the sign recognition stage, convolutional neural network is applied to recognize the regions of interest of the sign.
ko: 추상화된 이미지 그래프로 변환하고 부분 그래프를 추출하여 악성코드가 나타내는 집합을 정리하였다.

source: In this paper, the AdaBoost classifier is designed to decrease the number of undetected signs, and deep learning algorithm is used to increase recognition accuracy and which leads to removing false positives which occur in the sign detection stage.
ko: 제안한 논문에서 추출된 부분 집합들 간의 비교 분석을 통해 해당 악성코드들이 얼마나 유사한지를 실험으로 분석하였으며 학습을 통한 방법을 이용하여 빠르게 추출하였다.

source: Based on our experiments, proposed method efficiently decreases the number of false positives compared with other methods.
ko: 실험결과로부터 인공지능의 딥러닝을 이용한 정확한 악성코드 탐지 가능성과 악성코드를 이미지화하여 분류함으로써 더욱 빠르고 정확한 탐지 가능성을 보였다.

source: Recently, deep learning encoder-based approach has been actively applied in the field of sentiment classification.
ko: 본 논문은 딥러닝 알고리즘을 기반으로 하여 시각장애인을 위한 표지판을 검출하고 인식하는 시스템을 제안한다.

source: However, Long Short-Term Memory network deep learning encoder, the commonly used architecture, lacks the quality of vector representation when the length of the documents is prolonged.
ko: 제안된 시스템은 크게 표지판 검출 단계와 표지판 인식 단계로 나눠지는데 표지판 검출 단계에서는 영상에서 응집 채널 특징을 추출한 뒤 아다부스트 분류기를 적용하여 표지판 관심영역을 검출하였고, 표지판 인식 단계에서는 검출한 표지판 관심영역들에 합성곱 신경망을 적용하여 어떤 표지판인지 인식하였다.

source: In this study, for effective classification of the sentiment documents, we suggest the use of attention method-based deep learning encoder that generates document vector representation by weighted sum of the outputs of Long Short-Term Memory network based on importance.
ko: 본 논문에서는 미검출된 표지판의 개수가 최대한 감소하도록 아다부스트 분류기를 설계하였고, 딥러닝 알고리즘을 사용하여 인식 정확도를 높임으로써 검출 단계에서 발생한 양성 오류들을 제거시켰다.

source: In addition, we propose methods to modify the attention method-based deep learning encoder to suit the sentiment classification field, which consist of a part that is to applied to window attention method and an attention weight adjustment part.
ko: 실험 결과, 제안된 방법의 양성 오류 개수가 다른 방법들의 양성 오류 개수보다 효과적으로 감소했음을 확인하였다.

source: In the window attention method part, the weights are obtained in the window units to effectively recognize feeling features that consist of more than one word.
ko: 최근 감정 분류 분야에서 딥러닝 인코더 기반의 접근 방법이 활발히 적용되고 있다.

source: In the attention weight adjustment part, the learned weights are smoothened.
ko: 딥러닝 인코더 기반의 접근 방법은 가변 길이 문장을 고정 길이 문서 벡터로 압축하여 표현한다.

source: Experimental results revealed that the performance of the proposed method outperformed Long Short-Term Memory network encoder, showing 89.67% in accuracy criteria.
ko: 하지만 딥러닝 인코더에 흔히 사용되는 구조인 장･단기 기억망(Long Short-Term Memory network) 딥러닝 인코더는 문서가 길어지는 경우, 문서 벡터 표현의 품질이 저하된다고 알려져 있다.

source: Recently, the wide spread of IoT (Internet of Things) based technology enables the accumulation of big biometric data on livestock.
ko: 본 논문에서는 효과적인 감정 문서의 분류를 위해, 장･단기 기억망의 출력을 중요도에 따라 가중합하여 문서 벡터 표현을 생성하는 주목방법 기반의 딥러닝 인코더를 사용하는 것을 제안한다.

source: The availability of big data allows the application of diverse machine learning based algorithm in the field of agriculture, which significantly enhances the productivity of farms.
ko: 또한, 주목 방법 기반의 딥러닝 인코더를 문서의 감정 분류 영역에 맞게 수정하는 방법을 제안한다.

source: In this paper, we propose an abnormal livestock detection algorithm based on deep learning, which is the one of the most prominent machine learning algorithm.
ko: 제안하는 방법은 윈도우 주목 방법(Window Attention Method)을 적용한 단계와 주목 가중치 재조정(Weight Adjustment) 단계로 구성된다.

source: In our proposed scheme, the livestock are divided into two clusters which are normal and abnormal (disease) whose biometric data has different characteristics.
ko: 윈도우 주목 방법은 한 단어 이상으로 구성된 감정 자질을 효과적으로 인식하기 위해, 윈도우 단위로 가중치를 학습한다.

source: Then a deep neural network is used to classify these two clusters based on the biometric data.
ko: 주목 가중치 재조정에서는 학습된 가중치를 평활화(Smoothing) 한다, 실험 결과, 본 논문에서 제안하는 방법은 정확도 기준으로 89.67%의 성능을 나타내어 장･단기 기억망 인코더보다 높은 성능을 보였다.

source: By using our proposed scheme, the normal and abnormal livestock can be identified based on big biometric data, even though the detailed stochastic characteristics of biometric data are unknown, which is beneficial to prevent epidemic such as mouth-and-foot disease.
ko: 최근 들어, 효과적인 화재감지를 위해 이종 화재센서 데이터들을 융합하는 방안들이 제안되었으나, 룰 기반의 방법의 경우 적응성과 정밀도가 낮고, 퍼지추론의 경우 영상에 대한 고려 미흡으로 검출 속도와 정밀도가 떨어지는 등의 문제점들이 있다.

source: Recently, many embedded devices that have the computing capability required for deep learning have become available; hence, many new applications using these devices are emerging.
ko: 더불어 영상기반 딥러닝 기술들도 제안되었으나, 실제 상황에서 카메라가 없거나 카메라 영역 밖의 화재 발생에 대한 신속한 탐지가 어렵다.

source: However, these embedded devices have an architecture different from that of PCs and highperformance servers.
ko: 이에 본 논문에서는 CNN 기반의 딥러닝 알고리즘과 온도·습도·가스·연기를 포함하는 이종 화재센서 데이터기반의 퍼지추론엔진을 결합시킨 새로운 방식의 화재 감지 시스템을 제안한다.

source: In this paper, we propose a method that improves the performance of deep-learning framework by considering the architecture of an embedded device that shares memory between the CPU and the GPU.
ko: 이로써 영상 데이터를 활용한 신속한 화재 감지와 이종 센서 데이터들을 이용한 신뢰성 있는 화재 감지가 가능해짐을 보인다.

source: The proposed method is implemented in Caffe, an open-source deep-learning framework, and is evaluated on an NVIDIA Jetson TK1 embedded device.
ko: 또한, 대규모 시스템에서 컴퓨팅 파워의 지나친 서버 집중을 방지하기 위해 화재 인식 알고리즘에 분산 컴퓨팅 구조를 채택하여 확장성을 높인다.

source: In the experiment, we investigate the image recognition performance of several state-of-the-art deeplearning networks, including AlexNet, VGGNet, and GoogLeNet.
ko: 마지막으로, NIST 화재 동역학 시뮬레이터를 이용한 화재 시뮬레이션 데이터와 화재영상을 활용하여 화재가 점진적으로 번지는 환경과 급작스럽게 폭발이 발생하는 환경에서 실험을 수행함으로써 시스템의 성능을 검증한다.

source: Our results show that the proposed method can achieve significant performance gain.
ko: 최근 사물 인터넷 기술의 활용을 통해 가축 및 축사 관련 빅데이터 축적이 가능해 졌다.

source: For instance, in AlexNet, we could reduce image recognition latency by about 33% and energy consumption by about 50%.
ko: 이러한 빅 데이터를 기반으로 다양한 기계학습방안들이 가축관리에 적용되어 축산농가의 생산성을 크게 향상시키고 있다.

source: In this paper, we provide an authentication technology for verifying dynamic signature made by finger on smart phone.
ko: 본 연구에서는 현재 가장 주목받고 있는 기계학습 기술인 딥러닝을 적용한 질병개체 파악방안을 제안한다.

source: In the proposed method, we are using the Auto-Encoder-based 1 class model in order to effectively distinguish skilled forgery signature.
ko: 제안한 방안에서는 정상상태와 질병상태의 가축들이 섞여있는 환경에서 상태에 따라 다른 생체데이터 특성을 지닐 때 심층신경망을 이용하여 가축의 상태를 분류한다.

source: In addition to the basic dynamic signature characteristic information such as appearance and velocity of a signature, we use accelerometer value supported by most of the smartphone.
ko: 제안 방안은 가축 생체데이터의 통계적 특성을 모르는 상황에서도 학습을 통해서 가축의 상태를 정확하게 분류할 수 있다.

source: Signed data is re-sampled to give the same length and is normalized to a constant size.
ko: 질병개체의 정확한 파악은 구제역과 같은 전염성 질병을 예방하는데 큰 도움이 될 수 있다.

source: We built a test set for evaluation and conducted experiment in three ways.
ko: 최근, 딥러닝을 사용 가능한 임베디드 디바이스가 상용화됨에 따라 임베디드 시스템 영역에서도 딥러닝 활용에 대한 다양한 연구가 진행되고 있다.

source: As results of the experiment, the proposed acceleration sensor value and 1 class model shows 6.9% less EER than previous method.
ko: 그러나 임베디드 시스템을 고성능 PC 환경과 비교하면 상대적으로 저사양의 CPU/GPU 프로세서와 메모리를 탑재하고 있으므로 딥러닝 기술의 적용에 있어서 많은 제약이 있다.

source: In this paper, we propose a new automatic modulation classification method based on deep neural networks (DNN).
ko: 본 논문에서는 다양한 최신 딥러닝 네트워크들을 임베디드 디바이스에 적용했을때의 성능을 시간과 전력이라는 관점에서 실험적으로 평가한다.

source: The proposed method uses nineteen statistical features extracted from the received signal samples as an input to the fully connected neural networks with the four layers.
ko: 또한, 호스트 CPU와 GPU 디바이스간의 메모리를 공유하는 임베디드 시스템들의 아키텍처적인 특성을 이용하여 메모리 복사를 줄임으로써 실시간 성능과 저전력성을 높이는 방법을 제시한다.

source: The deep neural network is trained with the number of 30,000 training data generated by computer simulations.
ko: 제안된 방법은 대표적인 공개 딥러닝 프레임워크인 Caffe를 수정하여 구현되었으며, 임베디드 GPU를 탑재한 NVIDIA Jetson TK1에서 성능평가 되었다.

source: Various signal to noise ratios and fading channel conditions are considered for generation of the training data.
ko: 실험결과, 대부분의 딥러닝 네트워크에서 뚜렷한 성능향상을 관찰할 수 있었다.

source: The experimental results show that the proposed modulation classification technique outperforms the existing methods both in additive white Gaussian noise(AWGN) and Rician fading channels.
ko: 특히, 메모리 사용량이 높은 AlexNet에서 약 33%의 이미지 인식 속도 단축과 50%의 소비 전력량 감소를 관찰할 수 있었다.

source: Recently deep learning outstands because of big data, prevention of over-fitting and improvement of hardware.
ko: 본 논문에서는 스마트폰에서 손가락으로 서명하는 동적서명에서 위조서명에 강건한 검증 방법을 제안한다.

source: One of them an CNN(Convolutional Neural Networks) is available to robot environment because it achieves some degree of shift, deformation and scale invariance.
ko: 본 논문에서는 위조서명을 효과적으로 구분할 수 있도록 재생산 신경망의 일종인 1 class Auto-Encoder 모델을 사용한다.

source: In this paper, we experiment video-based face recognition using 3D CNN on the ETRI face video.
ko: 핑거서명에서는 지원되지 않는 펜 압력 등 기존의 특징 정보 대신 대부분의 스마트폰에서 지원하는 가속도센서를 추가로 활용하여 서명이 이루어지고 있는 동안 스마트폰의 동적인 움직임의 특징정보를 추출한다.

source: Training data is 50pictures captured from 1m away, and checking data are 50, 200, 100 pictures captured from 1m, 2m, 3m away and The rates of true recognition are 100%, 88% and 73% as maximum by varying the number of feature maps.
ko: 서명 데이터는 리샘플링을 통해 길이를 맞추고, 일정한 크기로 정규화하여 사용한다.
